In [3]:
import pandas as pd
df=pd.read_csv('C:/Users/keska/OneDrive/Desktop/fods/Datasets/heart.csv')

In [34]:
#checking for null values
print(df.isnull().sum())

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64

In [35]:
#checking for duplicates
print(df.duplicated().sum())

0

In [36]:
#drop duplicate rows
df=df.drop_duplicates()

In [37]:
print(df.duplicated().sum())
#data cleaning done

0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 302 entries, 0 to 878
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       302 non-null    float64
 1   sex       302 non-null    int64
 2   cp        302 non-null    int64
 3   trestbps  302 non-null    int64
 4   chol      302 non-null    int64
 5   fbs       302 non-null    int64
 6   restecg   302 non-null    int64
 7   thalach   302 non-null    int64
 8   exang     302 non-null    int64
 9   oldpeak   302 non-null    float64
 10  slope     302 non-null    int64
 11  ca        302 non-null    int64
 12  thal      302 non-null    int64
 13  target    302 non-null    int64
dtypes: float64(2), int64(12)
memory usage: 35.4 KB

In [15]:
df['age']=df['age'].astype('int64')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 302 entries, 0 to 878
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       302 non-null    int64
 1   sex       302 non-null    int64
 2   cp        302 non-null    int64
 3   trestbps  302 non-null    int64
 4   chol      302 non-null    int64
 5   fbs       302 non-null    int64
 6   restecg   302 non-null    int64
 7   thalach   302 non-null    int64
 8   exang     302 non-null    int64
 9   oldpeak   302 non-null    float64
 10  slope     302 non-null    int64
 11  ca        302 non-null    int64
 12  thal      302 non-null    int64
 13  target    302 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 35.4 KB

In [38]:
#error correction by filling mean values in age columns having incorrect values
df.loc[df['age']<0,'age'] = df['age'].mean()

In [19]:
df.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,52.0,1,0,125,212,0,1,168,0,1.0,2,2,3,0
1,53.0,1,0,140,203,1,0,155,1,3.1,0,0,3,0
2,70.0,1,0,145,174,0,1,125,1,2.6,0,0,3,0
3,61.0,1,0,148,203,0,1,161,0,0.0,2,1,3,0
4,62.0,0,0,138,294,1,1,106,0,1.9,1,3,2,0

In [29]:
# Example: correcting inconsistent labels
df['sex'] = df['sex'].replace({'1': 'Male', '0': 'Female'})

In [30]:
df.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,52.0,Male,0,125,212,0,1,168,0,1.0,2,2,3,0
1,53.0,Male,0,140,203,1,0,155,1,3.1,0,0,3,0
2,70.0,Male,0,145,174,0,1,125,1,2.6,0,0,3,0
3,61.0,Male,0,148,203,0,1,161,0,0.0,2,1,3,0
4,62.0,Female,0,138,294,1,1,106,0,1.9,1,3,2,0

In [28]:
df['sex']=df['sex'].astype('str')

In [32]:
#Save the cleaned and corrected dataset
df.to_csv('heart_cleaned_Dataset.csv',index=False)